import random
answers = ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", "Даже не думай",
           "Предрешено", "Вероятнее всего", "Спроси позже", "Мой ответ - нет",
           "Никаких сомнений", "Хорошие перспективы", "Лучше не рассказывать", "По моим данным - нет",
           "Можешь быть уверен в этом", "Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Как Вас зовут')
name=input()
print('Привет,', name)
while True:
    print('Какой вопросы вы хотите задать?')
    question=input()
    print(random.choice(answers))
    print('Хотите задать еще вопрос? (y-"да", n-"нет")')
    a=input()
    if a=='y':
        continue
    else:
        break
    